#Generated by Fabric Compiler ( version 2021.1-SP5 <build 79250> ) at Thu Sep 14 09:58:56 2023

add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_pllclkdiv.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_aon_wrapper.v"
add_design "C:/pango/prj/e203_test/source/core/e203_ifu.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_hclkgen_regs.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_lsuagu.v"
add_design "C:/pango/prj/e203_test/source/core/e203_lsu.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_flash_qspi.v"
add_design "C:/pango/prj/e203_test/source/core/e203_itcm_ctrl.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/timer_module.v"
add_design "C:/pango/prj/e203_test/source/core/e203_dtcm_ram.v"
add_design "C:/pango/prj/e203_test/source/apb_uart/uart_tx.v"
add_design "C:/pango/prj/e203_test/source/core/e203_irq_sync.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_LevelGateway.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_ram.v"
add_design "C:/pango/prj/e203_test/source/debug/sirv_jtag_dtm.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_rglr.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_pmu.v"
add_design "C:/pango/prj/e203_test/source/debug/sirv_debug_ram.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/prescaler.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_sram_icb_ctrl.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu.v"
add_design "C:/pango/prj/e203_test/source/apb_gpio/apb_gpio.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_excp.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_controller.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_longpwbck.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_disp.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_nice.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_aon_lclkgen_regs.v"
add_design "C:/pango/prj/e203_test/source/apb_i2c/i2c_master_byte_ctrl.v"
add_design "C:/pango/prj/e203_test/source/core/e203_extend_csr.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_ResetCatchAndSync_2.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_clint_top.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_plic_man.v"
add_design "C:/pango/prj/e203_test/source/fab/sirv_icb1to2_bus.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_jtaggpioport.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_clkgen.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_AsyncResetRegVec.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_wbck.v"
add_design "C:/pango/prj/e203_test/source/core/e203_ifu_litebpu.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_hclkgen_rstsync.v"
add_design "C:/pango/prj/e203_test/source/core/e203_biu.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/apb_adv_timer.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_csrctrl.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_qspi_physical.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_qspi_arbiter.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_top.v"
add_design "C:/pango/prj/e203_test/source/debug/sirv_debug_csr.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/comparator.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_regfile.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_decode.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_expl_axi_slv.v"
add_design "C:/pango/prj/e203_test/source/apb_i2c/i2c_master_bit_ctrl.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/up_down_counter.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_aon_top.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_tlfragmenter_qspi_1.v"
add_design "C:/pango/prj/e203_test/source/soc/e203_soc_top.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_bufs.v"
add_design "C:/pango/prj/e203_test/source/core/e203_dtcm_ctrl.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_AsyncResetRegVec_36.v"
add_design "C:/pango/prj/e203_test/source/core/e203_clkgate.v"
add_design "C:/pango/prj/e203_test/source/src/clkdivider.v"
add_design "C:/pango/prj/e203_test/source/core/e203_cpu_top.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_AsyncResetRegVec_1.v"
add_design "C:/pango/prj/e203_test/source/core/e203_srams.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/apb_spi_master.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_perips.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_queue_1.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_ResetCatchAndSync.v"
add_design "C:/pango/prj/e203_test/source/mems/sirv_mrom.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_sim_ram.v"
add_design "C:/pango/prj/e203_test/source/fab/sirv_icb1to16_bus.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_rtc.v"
add_design "C:/pango/prj/e203_test/source/core/e203_reset_ctrl.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_commit.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_tlwidthwidget_qspi.v"
add_design "C:/pango/prj/e203_test/source/core/e203_ifu_minidec.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_qspi_fifo.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_dffs.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_icbs.v"
add_design "C:/pango/prj/e203_test/source/core/e203_core.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_main.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_repeater_6.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_aon.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_branchslv.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_rx.v"
add_design "C:/pango/prj/e203_test/source/core/e203_itcm_ram.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_fifo.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_qspi_media.v"
add_design "C:/pango/prj/e203_test/source/fab/sirv_icb1to8_bus.v"
add_design "C:/pango/prj/e203_test/source/apb_uart/apb_uart.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_AsyncResetReg.v"
add_design "C:/pango/prj/e203_test/source/core/e203_lsu_ctrl.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_AsyncResetRegVec_129.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_tx.v"
add_design "C:/pango/prj/e203_test/source/apb_spi_master/spi_master_apb_if.v"
add_design "C:/pango/prj/e203_test/source/apb_i2c/apb_i2c.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_queue.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_dpath.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_pll.v"
add_design "C:/pango/prj/e203_test/source/apb_uart/uart_rx.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_mems.v"
add_design "C:/pango/prj/e203_test/source/apb_uart/uart_interrupt.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_oitf.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_nice_core.v"
add_design "C:/pango/prj/e203_test/source/mems/sirv_mrom_top.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/timer_cntrl.v"
add_design "C:/pango/prj/e203_test/source/debug/sirv_debug_module.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_muldiv.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_csr.v"
add_design "C:/pango/prj/e203_test/source/debug/sirv_debug_rom.v"
add_design "C:/pango/prj/e203_test/source/core/e203_ifu_ift2icb.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_clint.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_tl_repeater_5.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_flash_qspi_top.v"
add_design "C:/pango/prj/e203_test/source/core/e203_ifu_ifetch.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/input_stage.v"
add_design "C:/pango/prj/e203_test/source/src/system.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_hclkgen.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_plic_top.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_1cyc_sram_ctrl.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_plic.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_xchecker.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_clint.v"
add_design "C:/pango/prj/e203_test/source/core/e203_cpu.v"
add_design "C:/pango/prj/e203_test/source/core/e203_exu_alu_bjp.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_spi_flashmap.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_DeglitchShiftRegister.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_wdog.v"
add_design "C:/pango/prj/e203_test/source/apb_uart/io_generic_fifo.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_aon_porrst.v"
add_design "C:/pango/prj/e203_test/source/perips/sirv_pmu_core.v"
add_design "C:/pango/prj/e203_test/source/subsys/e203_subsys_gfcm.v"
add_design "C:/pango/prj/e203_test/source/apb_adv_timer/adv_timer_apb_if.v"
add_design "C:/pango/prj/e203_test/source/core/e203_clk_ctrl.v"
add_design C:/pango/prj/e203_test/ipcore/pll_clk/pll_clk.idf
add_design "C:/pango/prj/e203_test/source/core/e203_defines.v"
remove_design -verilog "C:/pango/prj/e203_test/source/core/e203_defines.v"
add_design "C:/pango/prj/e203_test/source/core/e203_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
remove_design -verilog "C:/pango/prj/e203_test/source/core/e203_defines.v"
add_design "C:/pango/prj/e203_test/source/core/e203_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
remove_design -verilog "C:/pango/prj/e203_test/source/core/e203_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
add_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
remove_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
add_design "C:/pango/prj/e203_test_v0/e203_test/e203_test.srcs/sim_1/imports/tb/tb_top.v"
remove_design -force -verilog "C:/pango/prj/e203_test_v0/e203_test/e203_test.srcs/sim_1/imports/tb/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
remove_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "C:/pango/prj/e203_test/source/e203_constraint.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_simulation "C:/pango/prj/e203_test/source/imports/tb/tb_top.v"
remove_simulation "C:/pango/prj/e203_test/source/imports/tb/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
remove_simulation -force "C:/pango/prj/e203_test/source/tb/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
remove_simulation -force "C:/pango/prj/e203_test/source/tb/tb_top.v"
add_design "C:/pango/prj/e203_test/source/soc/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/soc/tb_top.v"
remove_simulation -force "C:/pango/prj/e203_test/source/soc/tb_top.v"
remove_design -verilog "C:/pango/prj/e203_test/source/soc/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/tb_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
remove_simulation "C:/pango/prj/e203_test/source/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/source/tb/tb_top.v"
remove_simulation "C:/pango/prj/e203_test/source/source/tb/tb_top.v"
add_simulation "C:/pango/prj/e203_test/source/tb/tb_top.v"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/pango/prj/e203_test/source/general/sirv_sim_itcm.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
remove_fic -force"C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design C:/pango/prj/e203_test/ipcore/ddr3_ip/ddr3_ip.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module sirv_gnrl_icb2ahbl
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_fic "C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
remove_fic -force"C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_fic "C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
remove_fic -force"C:/pango/prj/e203_test/synthesize/system_syn.fic"
add_fic "C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
remove_fic -force"C:/pango/prj/e203_test/synthesize/system_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/pango/prj/e203_test/synthesize/system_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"C:/pango/prj/e203_test/synthesize/system_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/source/general/sirv_gnrl_icb32_to_axi64.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "C:/pango/prj/e203_test/source/source/general/sirv_gnrl_icb32_to_axi64.v"
add_design "C:/pango/prj/e203_test/source/general/sirv_gnrl_icb32_to_axi64.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/rtl/asyn_rst_syn.v"
add_design "C:/pango/prj/e203_test/source/rtl/ddr3_rw_top.v"
add_design "C:/pango/prj/e203_test/source/rtl/ddr3_top.v"
add_design "C:/pango/prj/e203_test/source/rtl/dvi_encoder.v"
add_design "C:/pango/prj/e203_test/source/rtl/dvi_transmitter_top.v"
add_design "C:/pango/prj/e203_test/source/rtl/hdmi_colorbar_top.v"
add_design "C:/pango/prj/e203_test/source/rtl/rw_ctrl_128bit.v"
add_design "C:/pango/prj/e203_test/source/rtl/serializer_10_to_1.v"
add_design "C:/pango/prj/e203_test/source/rtl/video_display.v"
add_design "C:/pango/prj/e203_test/source/rtl/video_driver.v"
add_design C:/pango/prj/e203_test/ipcore/frame_fifo/frame_fifo.idf
add_design C:/pango/prj/e203_test/ipcore/pll_hdmi/pll_hdmi.idf
remove_design -force -verilog "C:/pango/prj/e203_test/source/rtl/ddr3_rw_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
remove_design -force -verilog "C:/pango/prj/e203_test/source/rtl/video_display.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "C:/pango/prj/e203_test/source/rtl/ddr3_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/arp/arp.v"
add_design "C:/pango/prj/e203_test/source/arp/arp_rx.v"
add_design "C:/pango/prj/e203_test/source/arp/arp_tx.v"
add_design "C:/pango/prj/e203_test/source/arp/crc32_d8.v"
add_design "C:/pango/prj/e203_test/source/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "C:/pango/prj/e203_test/source/gmii_to_rgmii/rgmii_rx.v"
add_design "C:/pango/prj/e203_test/source/gmii_to_rgmii/rgmii_tx.v"
add_design "C:/pango/prj/e203_test/source/udp/udp.v"
add_design "C:/pango/prj/e203_test/source/udp/udp_rx.v"
add_design "C:/pango/prj/e203_test/source/udp/udp_tx.v"
add_design "C:/pango/prj/e203_test/source/rtl/eth_ctrl.v"
add_design "C:/pango/prj/e203_test/source/rtl/eth_top.v"
add_design "C:/pango/prj/e203_test/source/rtl/img_data_pkt.v"
add_design "C:/pango/prj/e203_test/source/rtl/start_transfer_ctrl.v"
add_design C:/pango/prj/e203_test/ipcore/async_fifo_1024x32b/async_fifo_1024x32b.idf
add_design C:/pango/prj/e203_test/ipcore/pll_sft/pll_sft.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
remove_design -force C:/pango/prj/e203_test/ipcore/pll_sft/pll_sft.idf
add_design C:/pango/prj/e203_test/ipcore/pll_sft/pll_sft.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/rtl/ax_debounce.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module sirv_axi_buffer
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/rtl/rcv_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design C:/pango/prj/e203_test/ipcore/itcm_ram_ip/itcm_ram_ip.idf
remove_design C:/pango/prj/e203_test/ipcore/itcm_ram_ip/itcm_ram_ip.idf
add_design C:/pango/prj/e203_test/ipcore/ip_itcm/ip_itcm.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design C:/pango/prj/e203_test/ipcore/lcd_fifo/lcd_fifo.idf
add_design "C:/pango/prj/e203_test/source/rtl/lcd_driver.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module sirv_jtaggpioport
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module sirv_jtaggpioport
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/ps2/ps2_top.v"
add_design "C:/pango/prj/e203_test/source/ps2/spi_drive.v"
add_design "C:/pango/prj/e203_test/source/ps2/tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module eth_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
add_design "C:/pango/prj/e203_test/source/sdcard/sd_card_cmd.v"
add_design "C:/pango/prj/e203_test/source/sdcard/sd_card_sec_read_write.v"
add_design "C:/pango/prj/e203_test/source/sdcard/sd_card_top.v"
add_design "C:/pango/prj/e203_test/source/sdcard/sd_card_user_top.v"
add_design "C:/pango/prj/e203_test/source/sdcard/spi_master.v"
add_design C:/pango/prj/e203_test/ipcore/sd_card_fifo/sd_card_fifo.idf
add_design "C:/pango/prj/e203_test/source/audio/audio_clock_regeneration_packet.v"
add_design "C:/pango/prj/e203_test/source/audio/audio_info_frame.v"
add_design "C:/pango/prj/e203_test/source/audio/audio_sample_packet.v"
add_design "C:/pango/prj/e203_test/source/audio/auxiliary_video_information_info_frame.v"
add_design "C:/pango/prj/e203_test/source/audio/packet_assembler.v"
add_design "C:/pango/prj/e203_test/source/audio/packet_picker.v"
add_design "C:/pango/prj/e203_test/source/audio/source_product_description_info_frame.v"
add_design "C:/pango/prj/e203_test/source/audio/tmds_channel.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -system_verilog -top_module system
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -create_bin_file 
